tests/Omnipay/Icepay/Mock/FetchPaymentMethodsSuccess.txt

HTTP/1.1 200 OK
Content-Length: 2923
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/7.5
X-Powered-By: ASP.NET
X-NLB: BELLA
Date: Wed, 04 Sep 2013 14:23:31 GMT

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetMyPaymentMethodsResponse xmlns="connect.icepay.com"><GetMyPaymentMethodsResult xmlns:a="http://schemas.datacontract.org/2004/07/APIService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:PaymentMethods xmlns:b="http://schemas.datacontract.org/2004/07/APIService.Responses"><b:PaymentMethod><b:Description>Direct Debit</b:Description><b:Issuers><b:Issuer><b:Countries><b:Country><b:CountryCode>NL</b:CountryCode><b:Currency>EUR</b:Currency><b:MaximumAmount>200000</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country></b:Countries><b:Description>Automatic incasso Ideal</b:Description><b:IssuerKeyword>IDEALINCASSO</b:IssuerKeyword></b:Issuer><b:Issuer><b:Countries><b:Country><b:CountryCode>NL</b:CountryCode><b:Currency>EUR</b:Currency><b:MaximumAmount>200000</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country></b:Countries><b:Description>Automatische incasso</b:Description><b:IssuerKeyword>INCASSO</b:IssuerKeyword></b:Issuer></b:Issuers><b:PaymentMethodCode>DDEBIT</b:PaymentMethodCode></b:PaymentMethod><b:PaymentMethod><b:Description>Direct e-Banking</b:Description><b:Issuers><b:Issuer><b:Countries><b:Country><b:CountryCode>AT</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>BE</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>CH</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>DE</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>ES</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>FR</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>GB</b:CountryCode><b:Currency>EUR, EUR, CHF, CHF, GBP, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country><b:Country><b:CountryCode>IT</b:CountryCode><b:Currency>EUR, CHF, GBP</b:Currency><b:MaximumAmount>1000001</b:MaximumAmount><b:MinimumAmount>30</b:MinimumAmount></b:Country></b:Countries><b:Description>Direct e-banking Retail</b:Description><b:IssuerKeyword>RETAIL</b:IssuerKeyword></b:Issuer></b:Issuers><b:PaymentMethodCode>DIRECTEBANK</b:PaymentMethodCode></b:PaymentMethod></a:PaymentMethods></GetMyPaymentMethodsResult></GetMyPaymentMethodsResponse></s:Body></s:Envelope>
